In [196]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import math
%matplotlib inline

In [143]:
def entropy(prob_list):
    ent = 0.0
    for each in prob_list:
        if each != 0:
            ent += -(each*np.log2(each))
    return ent

def information_gain():
    pass

In [145]:
entropy([1/2, 1/2])

1.0

### loading data

In [72]:
data = pd.read_csv('../dataset/titanic.csv')

In [73]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [74]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [75]:
#drop irrelevent features
useless = ['PassengerId', 'Name', 'Ticket', 'Cabin', 'Embarked']
data_clean = data.drop(useless, axis = 1)

In [76]:
data_clean.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare
0         0       3    male  22.0      1      0   7.2500
1         1       1  female  38.0      1      0  71.2833
2         1       3  female  26.0      0      0   7.9250
3         1       1  female  35.0      1      0  53.1000
4         0       3    male  35.0      0      0   8.0500

In [78]:
survived = data_clean.Survived
data_clean = data_clean.drop('Survived', axis = 1)

In [79]:
data_clean.head()

   Pclass  Sex   Age  SibSp  Parch     Fare
0       3    1  22.0      1      0   7.2500
1       1    0  38.0      1      0  71.2833
2       3    0  26.0      0      0   7.9250
3       1    0  35.0      1      0  53.1000
4       3    1  35.0      0      0   8.0500

In [80]:
# change the object type data into numerical type
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
data_clean['Sex'] = le.fit_transform(data_clean['Sex'])

In [81]:
data_clean.head()

   Pclass  Sex   Age  SibSp  Parch     Fare
0       3    1  22.0      1      0   7.2500
1       1    0  38.0      1      0  71.2833
2       3    0  26.0      0      0   7.9250
3       1    0  35.0      1      0  53.1000
4       3    1  35.0      0      0   8.0500

In [82]:
data_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 6 columns):
Pclass    891 non-null int64
Sex       891 non-null int64
Age       714 non-null float64
SibSp     891 non-null int64
Parch     891 non-null int64
Fare      891 non-null float64
dtypes: float64(2), int64(4)
memory usage: 41.8 KB

In [83]:
from sklearn.preprocessing import Imputer

imp = Imputer(missing_values='NaN', strategy='mean', axis = 0)

In [84]:
imp.fit(data_clean)

Imputer(axis=0, copy=True, missing_values='NaN', strategy='mean', verbose=0)

In [85]:
data_clean = imp.transform(data_clean)

In [86]:
frame = pd.DataFrame(data_clean)

In [87]:
frame.head()

     0    1     2    3    4        5
0  3.0  1.0  22.0  1.0  0.0   7.2500
1  1.0  0.0  38.0  1.0  0.0  71.2833
2  3.0  0.0  26.0  0.0  0.0   7.9250
3  1.0  0.0  35.0  1.0  0.0  53.1000
4  3.0  1.0  35.0  0.0  0.0   8.0500

In [88]:
frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 6 columns):
0    891 non-null float64
1    891 non-null float64
2    891 non-null float64
3    891 non-null float64
4    891 non-null float64
5    891 non-null float64
dtypes: float64(6)
memory usage: 41.8 KB

In [89]:
frame.loc[0]

0     3.00
1     1.00
2    22.00
3     1.00
4     0.00
5     7.25
Name: 0, dtype: float64

In [90]:
frame.head()

     0    1     2    3    4        5
0  3.0  1.0  22.0  1.0  0.0   7.2500
1  1.0  0.0  38.0  1.0  0.0  71.2833
2  3.0  0.0  26.0  0.0  0.0   7.9250
3  1.0  0.0  35.0  1.0  0.0  53.1000
4  3.0  1.0  35.0  0.0  0.0   8.0500

In [94]:
x = data_clean
y = survived.values

In [95]:
print(type(x), type(y))

<class 'numpy.ndarray'> <class 'numpy.ndarray'>

In [96]:
from sklearn.model_selection import train_test_split

In [97]:
X_train, X_test, y_train, y_test = train_test_split(x, y, test_size = 0.2)

In [98]:
print(x.shape, y.shape)

(891, 6) (891,)

### implementing decision tree

In [171]:
import math

In [194]:

def entropy(col): 
    freq = np.unique(col, return_counts=True)
    base = freq[0].shape[0]
    
    # If col has only single type of data
    if base == 1:
        return 0.0
    
    total = col.shape[0]
    ent = 0.0
    for each in freq[1]:
        p = each/total
        ent += -(p*math.log(p, base))
    return ent


def information_gain(label, col):
    base_entropy = entropy(label)
    total = col.shape[0]
    freq = np.unique(col, return_counts=True)
    info = 0.0
    for each in freq[i]:
        info += (each/total)*entropy([])

In [195]:
entropy(np.array([0, 1, 2, 3, 4, 5, 6, 7, 8]))

(array([0, 1, 2, 3, 4, 5, 6, 7, 8]), array([1, 1, 1, 1, 1, 1, 1, 1, 1]))
9

1.0000000000000002

In [161]:
(1/4)*math.log5(1/4)

NameError: name 'math' is not defined

array([1, 2, 3])